ademch/ESP32MLX/app_httpd.cpp
  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    size_t fb_len = 0;
  #endif

  if (fb->format == PIXFORMAT_JPEG)
  {
    log_i("PIXFORMAT == JPEG");

	#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
      fb_len = fb->len;
    #endif
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  }
  else
  {
	log_i("PIXFORMAT != JPEG");
	  
	jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;

    // marks the end of chunk stream
	httpd_resp_send_chunk(req, NULL, 0);

	#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
		fb_len = jchunk.len;
	#endif
  }

  // unlock dma memory buffer
  esp_camera_fb_return(fb);

  #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    int64_t fr_end = esp_timer_get_time();
	log_i("JPG: %u kb %ums", (uint32_t)(fb_len) >> 10, (uint32_t)((fr_end - fr_start) / 1000));
  #endif

  return res;
}

// GET /capture90640
// Get image in BMP format
//
// Input: req- valid request
static esp_err_t mlx90640_capture_handler(httpd_req_t *req)
{
	esp_err_t res = ESP_OK;

	#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
		int64_t fr_start = esp_timer_get_time();
	#endif

	log_i("/capture90640 received");

	mlx_fb_t fb = {};

	fb = MLX90640_fb_get();

		httpd_resp_set_type(req, "image/bmp");
		httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
		httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

		char ts[32];
		snprintf(ts, 32, "%lld.%06ld", fb.timestamp.tv_sec, fb.timestamp.tv_usec);
		httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

		res = httpd_resp_send(req, (const char *)fb.buf, fb.len);

	MLX90640_fb_return(fb);

	#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
		int64_t fr_end = esp_timer_get_time();
		log_i("BMP: %u kb %ums", (uint32_t)(fb.len) >> 10, (uint32_t)((fr_end - fr_start) / 1000));
	#endif

	return res;
}


// GET /stream
//
// Input: req- valid request
static esp_err_t stream2640_handler(httpd_req_t *req)
{
    struct timeval _timestamp;
    size_t buffer_jpg_len = 0;
    uint8_t *buffer_jpg = NULL;

    #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        static int64_t last_frame = 0;
	    if (!last_frame) last_frame = esp_timer_get_time();
    #endif

    esp_err_t res;
    res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    if (res != ESP_OK) return res;

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    #if defined(LED_GPIO_NUM)
        isStreaming = true;
        enable_led(true);
    #endif

    camera_fb_t* fb = NULL;
    while (true)
    {
        fb = esp_camera_fb_get();
        if (!fb) {
            log_e("Camera capture failed");
            res = ESP_FAIL;
	        break;
        }
    
        _timestamp.tv_sec  = fb->timestamp.tv_sec;
        _timestamp.tv_usec = fb->timestamp.tv_usec;
    
        if (fb->format != PIXFORMAT_JPEG)
	    {
            bool jpeg_converted = frame2jpg(fb, 80, &buffer_jpg, &buffer_jpg_len);
    
            esp_camera_fb_return(fb);
            fb = NULL;
    
            if (!jpeg_converted) {
                log_e("JPEG compression failed");
                res = ESP_FAIL;
            }
        }
	    else {
	  	    buffer_jpg     = fb->buf;
	  	    buffer_jpg_len = fb->len;
        }
    
        // --boundary
		if (res == ESP_OK)
            res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
    
        if (res == ESP_OK)
	    {
	  	    char bufferHeader[128];
	  	    size_t hlen = snprintf(bufferHeader, 128,
								   _STREAM_JPG_PART, buffer_jpg_len, _timestamp.tv_sec, _timestamp.tv_usec);
	  	    
			// Content-Type: type
			// Content-Length: len
			// X-Timestamp:
			// new line
			res = httpd_resp_send_chunk(req, bufferHeader, hlen);
        }
    
		// Data
        if (res == ESP_OK)
            res = httpd_resp_send_chunk(req, (const char *)buffer_jpg, buffer_jpg_len);
    
        if (fb)
	    {
	  	    esp_camera_fb_return(fb);
	  	    fb		   = NULL;
	  	    buffer_jpg = NULL;	// pointer to fb internal structure
        }
	    else if (buffer_jpg)
	    {
	  	    free(buffer_jpg);
	  	    buffer_jpg = NULL;
        }
    
        if (res != ESP_OK) {
            log_e("Send frame failed");
            break;
        }
    
	    #if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
	  		int64_t fr_end = esp_timer_get_time();
	  		int64_t frame_time = (fr_end - last_frame) / 1000;
	  		last_frame = fr_end;
    
			uint32_t avg_frame_time = RunningAverage_run(&runningAverage, frame_time);
    
	  		log_i("MJPG: %u kb %ums (%.1ffps), AVG: %ums (%.1ffps)", (uint32_t)(buffer_jpg_len) >> 10,
	  			  (uint32_t)frame_time,
	  			  1000.0 / (uint32_t)frame_time,
	  			  avg_frame_time,
	  			  1000.0 / avg_frame_time
	  			 );
	    #endif
    }

	#if defined(LED_GPIO_NUM)
		isStreaming = false;
		enable_led(false);
	#endif

	return res;
}

// GET /stream:82
//
// Input: req- valid request
static esp_err_t stream90640_handler(httpd_req_t *req)
{
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
	static int64_t last_frame = 0;
	if (!last_frame) last_frame = esp_timer_get_time();
#endif

	esp_err_t res;
	res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
	if (res != ESP_OK) return res;

	httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

	mlx_fb_t fb = {};
	while (true)
	{
		fb = MLX90640_fb_get();

			res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
			if (res == ESP_OK)
			{
				char bufferHeader[128];
				size_t hlen = snprintf(bufferHeader, 128,
									   _STREAM_BMP_PART, fb.len, fb.timestamp.tv_sec, fb.timestamp.tv_usec);

				res = httpd_resp_send_chunk(req, bufferHeader, hlen);
			}

			if (res == ESP_OK)
				res = httpd_resp_send_chunk(req, fb.buf, fb.len);

		MLX90640_fb_return(fb);

		if (res != ESP_OK) {
			log_e("Send frame failed");
			break;
		}

		#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
			int64_t fr_end = esp_timer_get_time();
			int64_t frame_time = (fr_end - last_frame) / 1000;
			last_frame = fr_end;

			uint32_t avg_frame_time = RunningAverage_run(&runningAverage, frame_time);

			log_i("BMP: %u b %ums (%.1ffps), AVG: %ums (%.1ffps)", (uint32_t)(fb.len),
				  (uint32_t)frame_time,
				  1000.0 / (uint32_t)frame_time,
				  avg_frame_time,
				  1000.0 / avg_frame_time
			     );
		#endif
	}

	return res;
}

